Repository: Julie-b35/PyCabine
Catalog: src/locales/*/LC_MESSAGES/tools.po
Languages: fr_fr

source: Error importing module %s : %s
fr_fr: Erreur lors de l'import du module %s : %s

source: Did you call the static 'Utils.setWorkDir()' method?
fr_fr: Avez-vous fait appel à la méthode static 'Utils.setWorkDir() ?

source: The Factory class was not properly initialized
fr_fr: La classe Factory n'a pas été initialisé

source: options
fr_fr: Arguments optionnels

source: usage:
fr_fr: Utilisation:

source: show this help message and exit
fr_fr: Affiche l'aide puis quite le programme.

source: description
fr_fr: Répondeur vocal accueillant des témoignage.

source: _epilog
fr_fr: Ce programme à été produit par la maison de quartier La touche.

source: The 'cls' attribute has not been defined.
fr_fr: L'attribut 'cls' n'a pas été définie.

source: Parameter '%s' is of incorrect type: expected %s, got %s.
fr_fr: Le paramètre '%s' est de type incorrecte : attendu %s, obtenu %s.

source: The '%s' parameter must not be an empty string.
fr_fr: Le paramètre '%s' ne doit pas être une chaîne vide.

source: The parameters 'method', and 'value' are not defined.
fr_fr: Les paramètres 'method', et 'value' ne sont pas définis.

source: Please define a method or value.
fr_fr: Merci de définir une méthode ou une valeur.

source: The parameters 'method', and 'value' are defined.
fr_fr: Les paramètres 'method', et 'value' sont définis.

source: Only one of the two parameters must be provided.
fr_fr: Seul un des deux paramètres doit être fournis.

source: The parameter '_cls' containing '%s', is not a valid class
fr_fr: Le paramètre '_cls' contenant '%s', n'est pas une classe valide

source: Here is the list of available classes : ('%s')
fr_fr: Voici la liste des classe disponibles : ('%s')

source: Tools have not been initialized.
fr_fr: Les outils ne sont pas encore initialisé
